In [12]:
import numpy as np

In [13]:
a=numpy.array([1,2,3],)

In [21]:
b=numpy.array([2,3,7])

In [14]:
a

array([1, 2, 3])

In [15]:
a.shape

(3,)

In [16]:
np.ones((3,3),dtype=int)

array([[1, 1, 1],
       [1, 1, 1],
       [1, 1, 1]])

In [19]:
np.zeros((4,4),dtype=int)

array([[0, 0, 0, 0],
       [0, 0, 0, 0],
       [0, 0, 0, 0],
       [0, 0, 0, 0]])

In [20]:
np.log(a)

array([ 0.        ,  0.69314718,  1.09861229])

In [22]:
z=a.dot(b)

In [23]:
z

29

In [24]:
z=np.dot(a,b)

In [25]:
z

29

In [26]:
import pandas as pd

In [30]:
df=pd.read_csv('C:\\Users\DILIP KUMAR\Downloads\Data.csv')

In [31]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [32]:
df.head(3)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [34]:
df[['Country']]

   Country
0   France
1    Spain
2  Germany
3    Spain
4  Germany
5   France
6    Spain
7   France
8  Germany
9   France

In [35]:
df[['Country','Age']]

   Country   Age
0   France  44.0
1    Spain  27.0
2  Germany  30.0
3    Spain  38.0
4  Germany  40.0
5   France  35.0
6    Spain   NaN
7   France  48.0
8  Germany  50.0
9   France  37.0

In [37]:
df[df.Country=='Spain'][['Age','Country']]

    Age Country
1  27.0   Spain
3  38.0   Spain
6   NaN   Spain

In [38]:
#count total attributes

In [39]:
df.count()

Country      10
Age           9
Salary        9
Purchased    10
dtype: int64

In [40]:
df.Age.sum()

349.0

In [41]:
#concatenate all countries name

In [42]:
df.Country.sum()

'FranceSpainGermanySpainGermanyFranceSpainFranceGermanyFrance'

In [44]:
df.groupby('Country').count()

         Age  Salary  Purchased
Country
France     4       4          4
Germany    3       2          3
Spain      2       3          3